app/controllers/users_controller.rb

  def create
    session[:user_params].deep_merge!(params[:user]) if params[:user]
    @user = User.new(session[:user_params])
    @user.current_step = session[:user_step]
    if @user.valid?
      if params[:back_button]
        @user.previous_step
      elsif @user.last_step?
        @user.save if @user.all_valid?
---
INSERT INTO "users" ("position", "position_text", "children", "alter", "martial_status", "employment_text", "organization_text", "country", "retweet_clicked", "employment", "bildung", "at_clicked", "language", "area", "organization", "geschlecht", "created_at", "updated_at", "twitter_account", "income", "bildung_text", "years") VALUES(0, '', NULL, 0, NULL, '', '', 0, 1, 0, 2, NULL, 10, NULL, 0, NULL, '2012-04-18 08:36:15', '2012-04-18 08:36:15', 2, 0, '', NULL)